# Exercícios

## Imports

In [144]:
import pandas as pd

## Arquivo ~~Exercicio_Pandas_1.csv~~ german_credit_data.csv

1. Carregue um arquivo CSV contendo dados de uma planilha e crie um DataFrame com o Pandas.

(*) datasource alterado para conseguir implementar consultas mais complexas

In [145]:
# Load datasource
data = pd.read_csv('./../../Datasets/german_credit_data.csv')

# Exluir primeira coluna (index duplicado)
data.drop(data.columns[0], axis=1, inplace=True)

display(data.shape, data.head())

(1000, 9)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car

2. Exiba as primeiras linhas do DataFrame para verificar os dados que foram carregados.

In [146]:
data.head()

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car

3. Verifique o número de linhas e colunas presentes no DataFrame.

In [147]:
display(f"{data.shape[0]} linhas, {data.shape[1]} colunas")

'1000 linhas, 9 colunas'

4. Utilize o método `info()` para obter informações sobre os tipos de dados e a contagem de valores não nulos em cada coluna.

In [148]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Age               1000 non-null   int64
 1   Sex               1000 non-null   object
 2   Job               1000 non-null   int64
 3   Housing           1000 non-null   object
 4   Saving accounts   817 non-null    object
 5   Checking account  606 non-null    object
 6   Credit amount     1000 non-null   int64
 7   Duration          1000 non-null   int64
 8   Purpose           1000 non-null   object
dtypes: int64(4), object(5)
memory usage: 70.4+ KB

5. Selecione uma coluna específica do DataFrame e exiba suas estatísticas básicas usando o método `describe()`.

In [149]:
# Obtendo a descrição da coluna Age
data['Age'].describe()

count    1000.000000
mean       35.546000
std        11.375469
min        19.000000
25%        27.000000
50%        33.000000
75%        42.000000
max        75.000000
Name: Age, dtype: float64

6. Faça uma filtragem no DataFrame para exibir apenas as linhas que atendam a determinada condição.

In [150]:
# Filtrando os registros cuja idade está entre o primeiro e o terceito quartis (IIQ)

# Extraindo os quartiles Q1 e Q3
quantiles = data['Age'].quantile([.25, .75]).values

# Montando o filtro
filtro = (data.Age >= quantiles[0]) & (data.Age <= quantiles[1]) 

display(f"Registros cuja idade está entre o Q1 ({int(quantiles[0])} anos) e o Q3 ({int(quantiles[1])} anos)", \
    data[filtro])

'Registros cuja idade está entre o Q1 (27 anos) e o Q3 (42 anos)'

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
5,35,male,1,free,NaN,NaN,9055,36,education
7,35,male,3,rent,little,moderate,6948,36,car
9,28,male,3,own,little,moderate,5234,30,car
14,28,female,2,rent,little,little,1403,15,car
15,32,female,1,own,moderate,little,1282,24,radio/TV
...,...,...,...,...,...,...,...,...,...
993,30,male,3,own,little,little,3959,36,furniture/equipment
995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
997,38,male,2,own,little,NaN,804,12,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

7. Crie uma nova coluna no DataFrame, calculando-a com base em outras colunas existentes.

In [151]:
'''
Criação da coluna 'prestação' (installment) com o resultado do valor do empréstimo (Credit amount) 
dividido pelo número de parcelas (Duration)
'''

data['installment'] = data['Credit amount']/data['Duration']
data.sample(10)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,installment
144,23,female,2,own,little,NaN,2288,21,furniture/equipment,108.952381
267,38,female,2,own,little,NaN,1533,24,radio/TV,63.875000
40,30,male,3,own,quite rich,NaN,2333,30,radio/TV,77.766667
684,31,male,1,own,moderate,moderate,9857,36,business,273.805556
540,23,male,2,rent,little,moderate,1534,12,radio/TV,127.833333
805,24,male,2,own,little,little,9271,36,car,257.527778
819,26,male,2,own,little,little,1345,18,radio/TV,74.722222
38,37,male,2,own,little,rich,1225,10,domestic appliances,122.500000
527,42,male,1,own,little,NaN,1503,4,radio/TV,375.750000
541,60,male,2,free,little,NaN,2032,24,car,84.666667

8. Agrupe o DataFrame com base em uma coluna específica e realize uma operação de agregação, como soma, média ou contagem.

In [152]:
data.groupby('Housing')['Credit amount'].agg(['mean', 'sum'])

                mean      sum
Housing
free     4906.212963   529871
own      3060.939691  2182450
rent     3122.553073   558937

9.  Utilize a função `apply()` para aplicar uma função personalizada a uma coluna ou linha do DataFrame.

In [153]:
# Cálculo da idade ao finalizar a duração do empréstimo

def calc_fim_emprestimo(idade_, duracao_):
    return int(idade_ + (duracao_/12))

assert calc_fim_emprestimo(20,18) == 21, "Resultado deve ser 21"

data['Age_Finish_Pay'] = data.apply(lambda row: calc_fim_emprestimo(row['Age'], row['Duration']),axis=1)

data[['Age', 'Duration', 'Age_Finish_Pay']].sample(10)

     Age  Duration  Age_Finish_Pay
838   63        24              65
395   32        39              35
281   50        12              51
433   33        24              35
823   47         8              47
808   55        42              58
263   57        12              58
0     67         6              67
390   30        18              31
298   43        18              44

10. Faça uma ordenação dos dados em ordem crescente ou decrescente com base em uma coluna específica.

In [154]:
# Ordenando por housing (descendente) e por sex (ascendente)
data.sort_values(by=['Housing', 'Sex'], ascending=[False, True]).head(10)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,installment,Age_Finish_Pay
10,25,female,2,rent,little,moderate,1295,12,car,107.916667,26
11,24,female,2,rent,little,little,4308,48,business,89.750000,28
14,28,female,2,rent,little,little,1403,15,car,93.533333,29
27,42,female,2,rent,rich,rich,409,12,radio/TV,34.083333,43
47,23,female,0,rent,quite rich,little,1352,6,car,225.333333,23
59,23,female,1,rent,little,little,6229,36,furniture/equipment,173.027778,26
82,24,female,1,rent,moderate,NaN,1568,18,business,87.111111,25
111,23,female,2,rent,little,rich,392,15,education,26.133333,24
117,27,female,2,rent,NaN,little,2132,10,furniture/equipment,213.200000,27
121,41,female,3,rent,little,NaN,3868,24,car,161.166667,43

11. Utilize o recurso de indexação booleana para filtrar o DataFrame com base em várias condições.

In [155]:
# Definição do filtro: registros de mulheres (female) que alugam (rent)
filtro = (data.Sex  == 'female') & (data.Housing == 'rent')

# Aplicação do filtro
data.loc[filtro, data.columns]

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose,installment,Age_Finish_Pay
10,25,female,2,rent,little,moderate,1295,12,car,107.916667,26
11,24,female,2,rent,little,little,4308,48,business,89.750000,28
14,28,female,2,rent,little,little,1403,15,car,93.533333,29
27,42,female,2,rent,rich,rich,409,12,radio/TV,34.083333,43
47,23,female,0,rent,quite rich,little,1352,6,car,225.333333,23
...,...,...,...,...,...,...,...,...,...,...,...
952,28,female,2,rent,quite rich,moderate,4113,24,car,171.375000,30
955,57,female,3,rent,rich,little,1231,24,radio/TV,51.291667,59
967,54,female,3,rent,little,NaN,3568,15,radio/TV,237.866667,55
972,29,female,0,rent,little,little,1193,24,car,49.708333,31
985,25,female,2,rent,little,little,1433,15,furniture/equipment,95.533333,26

## Arquivo Exercicio_Pandas_2.json

In [156]:
# Load datasource json
produtos1 = pd.read_json('./../../Datasets/Exercicio_Pandas_2.json')
display(produtos1.shape, produtos1.head())

(5, 4)

     Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Celular                 100            1000       100000
1         TV                  50            2000       100000
2   Notebook                  70            2500       175000
3     Tablet                  30             800        24000
4  Headphone                  80             150        12000

2.  Utilize técnicas de indexação avançada para selecionar, filtrar e modificar dados em um DataFrame.

In [157]:
# Produtos com valor unitário maior que a média
produtos1[produtos1.Valor_Unitario>produtos1.Valor_Unitario.mean()]

    Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
1        TV                  50            2000       100000
2  Notebook                  70            2500       175000

## Arquivos Exercicio_Pandas_2.json e Exercicio_Pandas_3.csv

1.  Combine dois DataFrames usando operações de junção (merge) ou concatenação.

In [158]:
# Load de arquivo deparado por tabulações (tsv)
produtos2 = pd.read_csv('./../../Datasets/Exercicio_Pandas_3.csv', sep='\t')

display(produtos2.shape, produtos2.head())

(2, 4)

   Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0    Mouse                  60              50         3000
1  Teclado                  40             100         4000

In [159]:
# Concatendando 2 dataframes com o mesmo layout e resetando o índice para evitar duplicidades
produtos_full = pd.concat([produtos1, produtos2]).reset_index()

# Renomeando o antigo índice para não perder rastrabilidade
produtos_full.rename(columns={'index': 'old_index'}, inplace=True)

produtos_full

   old_index    Produto  Quantidade_Vendida  Valor_Unitario  Valor_Total
0          0    Celular                 100            1000       100000
1          1         TV                  50            2000       100000
2          2   Notebook                  70            2500       175000
3          3     Tablet                  30             800        24000
4          4  Headphone                  80             150        12000
5          0      Mouse                  60              50         3000
6          1    Teclado                  40             100         4000

In [160]:
# categorizar produtos por quantidade vendida: low, med, high
produtos_full['categ_vendas'] = pd.cut(produtos_full['Quantidade_Vendida'],bins=3, labels=('low', 'med', 'high'))

display(produtos_full)

,old_index,Produto,Quantidade_Vendida,Valor_Unitario,Valor_Total,categ_vendas
0,0,Celular,100,1000,100000,high
1,1,TV,50,2000,100000,low
2,2,Notebook,70,2500,175000,med
3,3,Tablet,30,800,24000,low
4,4,Headphone,80,150,12000,high
5,0,Mouse,60,50,3000,med
6,1,Teclado,40,100,4000,low

   
2.  Utilize o método `groupby()` para agrupar os dados por múltiplas colunas e realizar operações de agregação em grupos.

In [161]:
# Agrupando os valor de emrpéstimo agregado por sexo e categoria de ahorros e calculando a soma e média 
data.groupby(['Sex', 'Saving accounts'])['Credit amount'].agg(['sum', 'mean'])

                            sum         mean
Sex    Saving accounts
female little            560031  2886.757732
       moderate           96013  3000.406250
       quite rich         50649  3165.562500
       rich               35849  1886.789474
male   little           1362232  3330.640587
       moderate          252543  3556.943662
       quite rich        111394  2370.085106
       rich               87674  3023.241379